app/controllers/patients_controller.rb

INSERT INTO "patients" ("name", "hospital", "surgeon", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Morgan"], ["hospital", "howell"], ["surgeon", "1"], ["created_at", "2015-08-19 04:32:38.504627"], ["updated_at", "2015-08-19 04:32:38.504627"]]
---
  def create
    #creating a new patient that is associated with the cookie on the surgeon's browser
    @patient = Patient.new(name: params[:patient][:name], hospital: params[:patient][:hospital],
      surgeon: "#{session[:user_id]}")

    if @patient.save

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "patients" SET "device" = ?, "updated_at" = ? WHERE "patients"."id" = ?  [["device", "2.5mmStrykerScrew5mmwhatever"], ["updated_at", "2015-08-20 07:31:46.654066"], ["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def curl_post_request
    key = params[:api_key]
    patient = params[:name]
    surgeon_id = params[:surgeon_id]
    devices = params[:device]
    hospital = params[:hospital]
    patient_id = params[:patient_id]
    annotation = params[:annotation]

    if key == "SDFHJkjhGRDfghjTRDFghj" #key matches
      if patient_id && surgeon_id && devices  #correct parameters supplied
        patient_model = Patient.find(patient_id)

        if patient_model.surgeon!=surgeon_id #requesting surgeon owns patient
          return render text: "FORBIDDEN TO EDIT THIS CLIENT - RESPONSE 403\n"
        else
          patient_model.assign_attributes(device: devices, annotation: annotation)
          if patient_model.save #checking to see if patient notes were actually saved to DB
            return render text: "Success! Patient notes were saved under #{User.find(surgeon_id).name}\n"