app/controllers/users_controller.rb

  def show
    if "#{params[:id]}" == "#{session[:user_id]}"
      @user = User.find(params[:id])
      #find all patients that are associated with this surgeon
      @patient = Patient.new
      @current_patients = []
      @current_patients += Patient.where(surgeon: params[:id]).to_a if Patient.find_by(surgeon: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "patients".* FROM "patients" WHERE "patients"."surgeon" = ? LIMIT 1  [["surgeon", "1"]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)